PreterCur/gd32f103-freertos-makefile-template/User/Source/main.c
/*!
    \file  main.c
    \brief running led
    
    \version 2019-6-5, V1.0.0, firmware for GD32VF103
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32f10x.h"
#include "systick.h"
#include <stdio.h>
#include"FreeRTOS.h"
#include "task.h"

#include "lwmem.h"
#include "user_debug.h"

void MemoryManagerInit(void);
uint8_t __attribute__ ((section(".lwmem_heap"))) region1_data[5000];
static lwmem_region_t
regions[] = {
    { region1_data, sizeof(region1_data) },

};

void MemoryManagerInit(void)
{
    DEBUG_LOG("Initializing LwMEM...\r\n");
    memset(regions->start_addr, 0, regions->size);
    if (!lwmem_assignmem(regions, 1)){
        DEBUG_ERR("Cannot initialize LwMEM. Make sure your regions are not overlapping each other and are in ascending memory order\r\n");
        while(1);
    }
    else {
        DEBUG_LOG("LwMEM initialized and ready to use\r\n");
    }
}

/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
int main(void)
{
    MemoryManagerInit();
    
    systick_config();
    /* enable the LED clock */
    rcu_periph_clock_enable(RCU_GPIOB);
    /* configure LED GPIO port */
    gpio_init(GPIOB, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_2);
    gpio_bit_reset(GPIOB, GPIO_PIN_2);

    while(1){
        gpio_bit_set(GPIOB, GPIO_PIN_2);
        delay_1ms(1000);
        gpio_bit_reset(GPIOB, GPIO_PIN_2);
        delay_1ms(1000);
    }
}
